Reports/ВыработкаИсполнителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ВыработкаИсполнителей</Name>
			<Comment>Выработка исполнителей</Comment>
		</Properties>
	</Report>
</MetaDataObject>

Enums/ФорматПредставленияГодаВыпускаАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФорматПредставленияГодаВыпускаАвтомобиля</Name>
			<Comment>Формат представления года выпуска автомобиля</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ddMMyyyy</Name>
					<Comment>ДФ=dd.MM.yyyy</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MMyyyy</Name>
					<Comment>ДФ=MM.yyyy</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>yyyy</Name>
					<Comment>ДФ=yyyy</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ВыработкаИсполнителей/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

// Стандартная процедура настройки схемы компоновщика данных
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ФорматПредставленияГодаВыпускаАвтомобиля = АвтомобилиСервер.ПолучитьФорматПредставленияГодаВыпускаАвтомобиля(Неопределено);
	Для Каждого ТекНабор Из СхемаКомпоновкиДанных.НаборыДанных Цикл
		Для Каждого ТекПоле Из ТекНабор.Поля Цикл
			Если НЕ ТипЗнч(ТекПоле) = Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			ИмяПоля = СокрЛП(ТекПоле.Поле);
			Если ИмяПоля = "ГодВыпуска" Тогда
				ТекПоле.ПараметрыРедактирования.УстановитьЗначениеПараметра("ФорматРедактирования", ФорматПредставленияГодаВыпускаАвтомобиля);
				ТекПоле.Оформление.УстановитьЗначениеПараметра("Формат", ФорматПредставленияГодаВыпускаАвтомобиля);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ФорматПредставления = ПраваИНастройкиПользователя.Значение("ФорматПредставленияГодаВыпускаАвтомобиля");
	
	Если ФорматПредставления = Перечисления.ФорматПредставленияГодаВыпускаАвтомобиля.MMyyyy ИЛИ 
		ФорматПредставления = Перечисления.ФорматПредставленияГодаВыпускаАвтомобиля.yyyy Тогда
		
		ПолеПоиска      = Новый ПолеКомпоновкиДанных("ГодВыпуска");
		НайденныеОтборы = Новый Массив;
		ПолучитьОтборСКД(ПолеПоиска, КомпоновщикНастроек.Настройки.Отбор.Элементы, НайденныеОтборы);
		Для Каждого ТекОтбор Из НайденныеОтборы Цикл
			Если ФорматПредставления = Перечисления.ФорматПредставленияГодаВыпускаАвтомобиля.MMyyyy Тогда
				ТекОтбор.ПравоеЗначение = НачалоМесяца(ТекОтбор.ПравоеЗначение);
			ИначеЕсли ФорматПредставления = Перечисления.ФорматПредставленияГодаВыпускаАвтомобиля.yyyy Тогда
				ТекОтбор.ПравоеЗначение = НачалоГода(ТекОтбор.ПравоеЗначение);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ОтчетыПлатформаСервер.ВывестиОтчет(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьОтборСКД(ПолеКомпоновки, Отбор, НайденныеОтборы)
	
	Для Каждого ТекОтбор Из Отбор Цикл
		Если ТекОтбор.Использование Тогда
			Если ТипЗнч(ТекОтбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
				ПолучитьОтборСКД(ПолеКомпоновки, ТекОтбор.Элементы, НайденныеОтборы);
			ИначеЕсли ТипЗнч(ТекОтбор) = Тип("ЭлементОтбораКомпоновкиДанных") И ТекОтбор.ЛевоеЗначение = ПолеКомпоновки Тогда
				НайденныеОтборы.Добавить(ТекОтбор);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
